app/views/posts/_side_bar.html.erb

    Comments
    <% if @post.comments.count != 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]

            <span class="list-group-item-text">
              Posted By <%= comment.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]