app/views/posts/index.html.erb

          <p>
            Posted By <%= item.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]