app/views/posts/show.html.erb

      <span class="list-group-item-text">
        Posted By <%= @post.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]