app/controllers/categories_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  ORDER BY "posts"."updated_at" DESC  [["category_id", 4]]
SELECT "categories".* FROM "categories"
---
  def show
    # for specific category display of blog, this is when a user will click
    # the side bar on a specific category
    @posts = Post.where(category_id: params[:id]).order(updated_at: :desc)
    # for side_bar display of categories
    @categories = Category.all