app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", ";lskdj;LSAKDJAL;skdjals;kDJAls;kdhskljfhsdlkjfaksjdfnklsdajn"], ["post_id", 9], ["created_at", "2015-11-05 03:40:25.789732"], ["updated_at", "2015-11-05 03:40:25.789732"]]
---
  def create
    @post = Post.find params[:post_id]

    # associates the post with the user
    @post.user_id = current_user

    # [IMPROVE] check if there's a need to create global variable here
    comment_params = params.require(:comment).permit(:body)
    @comment = Comment.new(comment_params)

    # associates the comment with the post
    @comment.post = @post
    # @comment.user = current_user.id # this will generate error
    # @comment.user_id = current_user # this will not update user_id
    # @comment.user_id = current_user.id # this will update user_id
    @comment.user = current_user

    # check if successful db query
    if @comment.save

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "11111111dasfsadfasdf"], ["updated_at", "2015-11-12 01:23:50.153545"], ["id", 39]]
---
  def update
    # calls before action callback find_comment
    if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 39]]
---
  def destroy
    # calls before action callback find_comment
    if @comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 41]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 28]]
---
  def find_comment
    @comment = Comment.find(params[:id])
    @post = Post.find(params[:post_id])