app/controllers/home_controller.rb

SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts"
---
  def home
    @categories = Category.all
    @posts = Post.all