app/controllers/posts_controller.rb

  def index
    # the query will be used for the search functionality, the search method
    # is defined in the post model
    @query    = params[:query]
    @posts = Post.order(updated_at: :desc).search(params[:query])

    # for side_bar display of categories
    @categories = Category.all
---
SELECT "posts".* FROM "posts" WHERE (LOWER(title) LIKE '%today%' OR LOWER(body) LIKE '%today%')  ORDER BY "posts"."updated_at" DESC
SELECT "categories".* FROM "categories"

  def new
    @post = Post.new
    @category_options = Category.all.map{|u| [u.title, u.id]}
---
SELECT "categories".* FROM "categories"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "yuiyuiyuityuytrutru"], ["body", "urtyutryuyturyutryu"], ["user_id", 3], ["created_at", "2015-11-09 21:56:12.749021"], ["updated_at", "2015-11-09 21:56:12.749021"]]

  def edit
    # checking if the user has the ability to modify if not error
    # redirect_to root_path, alert: "Access denied." unless can? :edit, @post
    @category_options = Category.all.map{|u| [u.title, u.id]}
---
SELECT "categories".* FROM "categories"

  def update
    # get user input through params for this specific blog post
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "category_id" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Tips New Post Test2"], ["category_id", 1], ["updated_at", "2015-11-12 04:46:51.873159"], ["id", 31]]

  def find_post
    @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]