app/controllers/sessions_controller.rb

  def create
    # assign user local variable as the User data based on the email params
    user = User.find_by_email params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jdelacruz@gmail.com"]]