app/views/categories/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
            <p>
              Posted By <%= item.user.first_name %>